Revit 2027 API
FamilyThermalProperties.IsValid Method
 Confirms that the thermal properties are correctly set for assignment to a FamilySymbol.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsValid()
Public Function IsValid As Boolean
public:
bool IsValid()
member IsValid : unit -> bool
Return Value
Boolean
 True if the thermal properties are valid, false otherwise.
See Also
Reference
FamilyThermalProperties Class
Autodesk.Revit.DB Namespace